---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.Clear
source: html/ff65e8c4-89a6-99f7-2518-ecb5cc2d063b.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```